duksubbc/kumhoo_multiport_control/AN2659-IAP_using_user-bootloader.6ch/Project/STM8A_User-Bootloader_example/inc/stm8a_map.h
#define USART_SR_RESET_VALUE   ((u8)0xC0)
#define USART_BRR1_RESET_VALUE ((u8)0x00)
#define USART_BRR2_RESET_VALUE ((u8)0x00)
#define USART_CR1_RESET_VALUE  ((u8)0x00)
#define USART_CR2_RESET_VALUE  ((u8)0x00)
#define USART_CR3_RESET_VALUE  ((u8)0x00)
#define USART_CR4_RESET_VALUE  ((u8)0x00)
#define USART_CR5_RESET_VALUE  ((u8)0x00)
#define USART_CR6_RESET_VALUE  ((u8)0x00)
#define USART_GTR_RESET_VALUE  ((u8)0x00)
#define USART_PSCR_RESET_VALUE ((u8)0x00)

/**
  * @}
  */

/** @addtogroup USART_Registers_Bits_Definition
  * @{
  */

#define USART_SR_TXE   ((u8)0x80) /*!< Transmit Data Register Empty mask */
#define USART_SR_TC    ((u8)0x40) /*!< Transmission Complete mask */
#define USART_SR_RXNE  ((u8)0x20) /*!< Read Data Register Not Empty mask */
#define USART_SR_IDLE  ((u8)0x10) /*!< IDLE line detected mask */
#define USART_SR_OR   ((u8)0x08) /*!< OverRun error mask */
#define USART_SR_NF    ((u8)0x04) /*!< Noise Flag mask */
#define USART_SR_FE    ((u8)0x02) /*!< Framing Error mask */
#define USART_SR_PE    ((u8)0x01) /*!< Parity Error mask */

#define USART_BRR1_DIVM  ((u8)0xFF) /*!< LSB mantissa of USARTDIV [7:0] mask */

#define USART_BRR2_DIVM  ((u8)0xF0) /*!< MSB mantissa of USARTDIV [11:8] mask */
#define USART_BRR2_DIVF  ((u8)0x0F) /*!< Fraction bits of USARTDIV [3:0] mask */

#define USART_CR1_R8      ((u8)0x80) /*!< Receive Data bit 8 */
#define USART_CR1_T8      ((u8)0x40) /*!< Transmit data bit 8 */
#define USART_CR1_UARTD   ((u8)0x20) /*!< USART Disable (for low power consumption) */
#define USART_CR1_M       ((u8)0x10) /*!< Word length mask */
#define USART_CR1_WAKE    ((u8)0x08) /*!< Wake-up method mask */
#define USART_CR1_PCEN    ((u8)0x04) /*!< Parity Control Enable mask */
#define USART_CR1_PS      ((u8)0x02) /*!< USART Parity Selection */
#define USART_CR1_PIEN    ((u8)0x01) /*!< USART Parity Interrupt Enable mask */

#define USART_CR2_TIEN    ((u8)0x80) /*!< Transmitter Interrupt Enable mask */
#define USART_CR2_TCIEN   ((u8)0x40) /*!< TransmissionComplete Interrupt Enable mask */
#define USART_CR2_RIEN    ((u8)0x20) /*!< Receiver Interrupt Enable mask */
#define USART_CR2_ILIEN   ((u8)0x10) /*!< IDLE Line Interrupt Enable mask */
#define USART_CR2_TEN     ((u8)0x08) /*!< Transmitter Enable mask */
#define USART_CR2_REN     ((u8)0x04) /*!< Receiver Enable mask */
#define USART_CR2_RWU     ((u8)0x02) /*!< Receiver Wake-Up mask */
#define USART_CR2_SBK     ((u8)0x01) /*!< Send Break mask */

#define USART_CR3_LINEN   ((u8)0x40) /*!< Alternate Function outpu mask */
#define USART_CR3_STOP    ((u8)0x30) /*!< STOP bits [1:0] mask */
#define USART_CR3_CKEN    ((u8)0x08) /*!< Clock Enable mask */
#define USART_CR3_CPOL    ((u8)0x04) /*!< Clock Polarity mask */
#define USART_CR3_CPHA    ((u8)0x02) /*!< Clock Phase mask */
#define USART_CR3_LBCL    ((u8)0x01) /*!< Last Bit Clock pulse mask */

#define USART_CR4_LBDIEN  ((u8)0x40) /*!< LIN Break Detection Interrupt Enable mask */
#define USART_CR4_LBDL    ((u8)0x20) /*!< LIN Break Detection Length mask */
#define USART_CR4_LBDF    ((u8)0x10) /*!< LIN Break Detection Flag mask */
#define USART_CR4_ADD     ((u8)0x0F) /*!< Address of the USART node mask */

#define USART_CR5_SCEN    ((u8)0x20) /*!< Smart Card Enable mask */
#define USART_CR5_NACK    ((u8)0x10) /*!< Smart Card Nack Enable mask */
#define USART_CR5_HDSEL   ((u8)0x08) /*!< Half-Duplex Selection mask */
#define USART_CR5_IRLP    ((u8)0x04) /*!< Irda Low Power Selection mask */
#define USART_CR5_IREN    ((u8)0x02) /*!< Irda Enable mask */

#define USART_CR6_LDUM    ((u8)0x80) /*!< LIN Divider Update Method */
#define USART_CR6_LSLV    ((u8)0x20) /*!< LIN Slave Enable */
#define USART_CR6_LASE    ((u8)0x10) /*!< LIN Autosynchronization Enable */
#define USART_CR6_LHDIEN  ((u8)0x04) /*!< LIN Header Detection Interrupt Enable */
#define USART_CR6_LHDF    ((u8)0x02) /*!< LIN Header Detection Flag */
#define USART_CR6_LSF     ((u8)0x01) /*!< LIN Synch Field */

/**
  * @}
  */


/*----------------------------------------------------------------------------*/
/**
  * @brief LIN Universal Asynchronous Receiver Transmitter (LINUART1)
  */

typedef struct LINUART1_struct
{
  vu8 SR;       /*!< status register */
  vu8 DR;       /*!< data register */
  vu8 BRR1;     /*!< baud rate register */
  vu8 BRR2;     /*!< DIV mantissa[11:8] SCIDIV fraction */
  vu8 CR1;      /*!< control register 1 */
  vu8 CR2;      /*!< control register 2 */
  vu8 CR3;      /*!< control register 3 */
  vu8 CR4;      /*!< control register 4 */
  vu8 RESERVED; /*!< Reserved byte */
  vu8 CR6;      /*!< control register 5 */
}
LINUART1_TypeDef;

/** @addtogroup LINUART1_Registers_Reset_Value
  * @{
  */

#define LINUART1_SR_RESET_VALUE   ((u8)0xC0)
#define LINUART1_BRR1_RESET_VALUE ((u8)0x00)
#define LINUART1_BRR2_RESET_VALUE ((u8)0x00)
#define LINUART1_CR1_RESET_VALUE  ((u8)0x00)
#define LINUART1_CR2_RESET_VALUE  ((u8)0x00)
#define LINUART1_CR3_RESET_VALUE  ((u8)0x00)
#define LINUART1_CR4_RESET_VALUE  ((u8)0x00)
#define LINUART1_CR6_RESET_VALUE  ((u8)0x00)

/**
  * @}
  */

/** @addtogroup LINUART1_Registers_Bits_Definition
  * @{
  */

#define LINUART1_SR_TXE      ((u8)0x80) /*!< Transmit Data Register Empty mask */
#define LINUART1_SR_TC       ((u8)0x40) /*!< Transmission Complete mask */
#define LINUART1_SR_RXNE     ((u8)0x20) /*!< Read Data Register Not Empty mask */
#define LINUART1_SR_IDLE     ((u8)0x10) /*!< IDLE line detected mask */
#define LINUART1_SR_OR       ((u8)0x08) /*!< OverRun error mask */
#define LINUART1_SR_NF       ((u8)0x04) /*!< Noise Flag mask */
#define LINUART1_SR_FE       ((u8)0x02) /*!< Framing Error mask */
#define LINUART1_SR_PE       ((u8)0x01) /*!< Parity Error mask */

#define LINUART1_BRR1_DIVM   ((u8)0xFF) /*!< LSB mantissa of UARTDIV [7:0] mask */

#define LINUART1_BRR2_DIVM   ((u8)0xF0) /*!< MSB mantissa of UARTDIV [11:8] mask */
#define LINUART1_BRR2_DIVF   ((u8)0x0F) /*!< Fraction bits of UARTDIV [3:0] mask */

#define LINUART1_CR1_R8      ((u8)0x80) /*!< Receive Data bit 8 */
#define LINUART1_CR1_T8      ((u8)0x40) /*!< Transmit data bit 8 */
#define LINUART1_CR1_UARTD   ((u8)0x20) /*!< UART Disable (for low power consumption) */
#define LINUART1_CR1_M       ((u8)0x10) /*!< Word length mask */
#define LINUART1_CR1_WAKE    ((u8)0x08) /*!< Wake-up method mask */
#define LINUART1_CR1_PCEN    ((u8)0x04) /*!< Parity control enable mask */
#define LINUART1_CR1_PS      ((u8)0x02) /*!< Parity selection bit mask */
#define LINUART1_CR1_PIEN    ((u8)0x01) /*!< Parity interrupt enable bit mask */

