duksubbc/kumhoo_multiport_control/AN2659-IAP_using_user-bootloader.6ch/Project/STM8A_User-Bootloader_example/inc/stm8a_map.h
#define LINUART1_CR2_TIEN    ((u8)0x80) /*!< Transmitter Interrupt Enable mask */
#define LINUART1_CR2_TCIEN   ((u8)0x40) /*!< TransmissionComplete Interrupt Enable mask */
#define LINUART1_CR2_RIEN    ((u8)0x20) /*!< Receiver Interrupt Enable mask */
#define LINUART1_CR2_ILIEN   ((u8)0x10) /*!< IDLE Line Interrupt Enable mask */
#define LINUART1_CR2_TEN     ((u8)0x08) /*!< Transmitter Enable mask */
#define LINUART1_CR2_REN     ((u8)0x04) /*!< Receiver Enable mask */
#define LINUART1_CR2_RWU     ((u8)0x02) /*!< Receiver Wake-Up mask */
#define LINUART1_CR2_SBK     ((u8)0x01) /*!< Send Break mask */

#define LINUART1_CR3_LINEN   ((u8)0x40) /*!< Alternate Function outpu mask */
#define LINUART1_CR3_STOP    ((u8)0x30) /*!< STOP bits [1:0] mask */

#define LINUART1_CR4_LBDIEN  ((u8)0x40) /*!< LIN Break Detection Interrupt Enable mask */
#define LINUART1_CR4_LBDL    ((u8)0x20) /*!< LIN Break Detection Length mask */
#define LINUART1_CR4_LBDF    ((u8)0x10) /*!< LIN Break Detection Flag mask */
#define LINUART1_CR4_ADD     ((u8)0x0F) /*!< Address of the LINUART1 node mask */

#define LINUART1_CR6_LDUM    ((u8)0x80) /*!< LIN Divider Update Method */
#define LINUART1_CR6_LSLV    ((u8)0x20) /*!< LIN Slave Enable */
#define LINUART1_CR6_LASE    ((u8)0x10) /*!< LIN Autosynchronization Enable */
#define LINUART1_CR6_LHDIEN  ((u8)0x04) /*!< LIN Header Detection Interrupt Enable */
#define LINUART1_CR6_LHDF    ((u8)0x02) /*!< LIN Header Detection Flag */
#define LINUART1_CR6_LSF     ((u8)0x01) /*!< LIN Synch Field */

/**
  * @}
  */


/*----------------------------------------------------------------------------*/
/**
  * @brief Controller Area Network  (CAN)
  */

typedef struct
{
  vu8 MCR;    /*!< CAN master control register */
  vu8 MSR;    /*!< CAN master status register */
  vu8 TSR;    /*!< CAN transmit status register */
  vu8 TPR;    /*!< CAN transmit priority register */
  vu8 RFR;    /*!< CAN receive FIFO register */
  vu8 IER;    /*!< CAN interrupt enable register */
  vu8 DGR;    /*!< CAN diagnosis register */
  vu8 PSR;    /*!< CAN page selection register */

  union
  {
    volatile struct
    {
      u8 MCSR;
      u8 MDLCR;
      u8 MIDR1;
	    u8 MIDR2;
	    u8 MIDR3;
	    u8 MIDR4;
      u8 MDAR[8];
      u8 MTSLR;
      u8 MTSHR;
    }
	  TxMailbox;

	volatile struct
    {
      u8 FR[16];
    }
	Filter;
	  

    volatile struct
    {
      u8 F0R1;
      u8 F0R2;
      u8 F0R3;
      u8 F0R4;
      u8 F0R5;
      u8 F0R6;
      u8 F0R7;
      u8 F0R8;

      u8 F1R1;
      u8 F1R2;
      u8 F1R3;
      u8 F1R4;
      u8 F1R5;
      u8 F1R6;
      u8 F1R7;
	    u8 F1R8;
    }
	  Filter01;
    
    volatile struct
    {
      u8 F2R1;
      u8 F2R2;
      u8 F2R3;
      u8 F2R4;
      u8 F2R5;
      u8 F2R6;
      u8 F2R7;
      u8 F2R8;
	
      u8 F3R1;
      u8 F3R2;
      u8 F3R3;
      u8 F3R4;
      u8 F3R5;
      u8 F3R6;
      u8 F3R7;
      u8 F3R8;
    }
	  Filter23;
    
    volatile struct
    {
      u8 F4R1;
      u8 F4R2;
      u8 F4R3;
      u8 F4R4;
      u8 F4R5;
      u8 F4R6;
      u8 F4R7;
      u8 F4R8;
			
      u8 F5R1;
      u8 F5R2;
      u8 F5R3;
      u8 F5R4;
      u8 F5R5;
      u8 F5R6;
      u8 F5R7;
      u8 F5R8;
    }
	  Filter45;
    
    volatile struct
    {
      u8 ESR;
      u8 EIER;
      u8 TECR;
      u8 RECR;
      u8 BTR1;
      u8 BTR2;
      u8 Reserved1[2];
      u8 FMR1;
      u8 FMR2;
      u8 FCR1;
      u8 FCR2;
      u8 FCR3;
      u8 Reserved2[3];
    }
		Config;
    
    volatile struct
    {
      u8 MFMI;
      u8 MDLC;
      u8 MIDR1;
      u8 MIDR2;
      u8 MIDR3;
      u8 MIDR4;
      u8 MDAR[8];
      u8 MTSLR;
      u8 MTSHR;
    }
	  RxFIFO;
  }Page; 
} CAN_TypeDef;
/** @addtogroup CAN_Registers_Bits_Definition
  * @{
  */
/*******************************Commun****************************************/
/* CAN Master Control Register bits */
#define CAN_MCR_INRQ     ((u8)0x01)
#define CAN_MCR_SLEEP    ((u8)0x02)
#define CAN_MCR_TXFP     ((u8)0x04)
#define CAN_MCR_RFLM     ((u8)0x08)
#define CAN_MCR_NART     ((u8)0x10)
#define CAN_MCR_AWUM     ((u8)0x20)
#define CAN_MCR_ABOM     ((u8)0x40)
#define CAN_MCR_TTCM     ((u8)0x80)

/* CAN Master Status Register bits */
#define CAN_MSR_INAK     ((u8)0x01)
#define CAN_MSR_SLAK     ((u8)0x02)
#define CAN_MSR_ERRI     ((u8)0x04)
#define CAN_MSR_WKUI     ((u8)0x08)
#define CAN_MSR_TX       ((u8)0x10)
#define CAN_MSR_RX       ((u8)0x20)

/* CAN Transmit Status Register bits */
#define CAN_TSR_RQCP0    ((u8)0x01)
#define CAN_TSR_RQCP1    ((u8)0x02)
#define CAN_TSR_RQCP2    ((u8)0x04)
#define CAN_TSR_TXOK0    ((u8)0x10)
#define CAN_TSR_TXOK1    ((u8)0x20)
#define CAN_TSR_TXOK2    ((u8)0x40)

#define CAN_TPR_CODE0    ((u8)0x01)
#define CAN_TPR_TME0     ((u8)0x04)
#define CAN_TPR_TME1     ((u8)0x08)
#define CAN_TPR_TME2     ((u8)0x10)
#define CAN_TPR_LOW0     ((u8)0x20)
#define CAN_TPR_LOW1     ((u8)0x40)
#define CAN_TPR_LOW2     ((u8)0x80)
/* CAN Receive FIFO Register bits */
#define CAN_RFR_FMP01  ((u8)0x03)
#define CAN_RFR_FULL   ((u8)0x08)
#define CAN_RFR_FOVR   ((u8)0x10)
#define CAN_RFR_RFOM   ((u8)0x20)

/* CAN Interrupt Register bits */
#define CAN_IER_TMEIE  ((u8)0x01)
#define CAN_IER_FMPIE0 ((u8)0x02)
#define CAN_IER_FFIE0  ((u8)0x04)
#define CAN_IER_FOVIE0 ((u8)0x08)
#define CAN_IER_WKUIE  ((u8)0x80)


/* CAN diagnostic Register bits */
#define CAN_DGR_LBKM  ((u8)0x01)
#define CAN_DGR_SLIM  ((u8)0x02)
#define CAN_DGR_SAMP  ((u8)0x03)
#define CAN_DGR_RX    ((u8)0x04)
#define CAN_DGR_3TX   ((u8)0x08)


/* CAN page select Register bits */
#define CAN_PSR_PS0  ((u8)0x01)
#define CAN_PSR_PS1  ((u8)0x02)
#define CAN_PSR_PS2  ((u8)0x04)

/**************************Tx MailBox Page*****************************************/

#define CAN_MCSR_ABRQ    ((u8)0x02)
/*************************Filter Page**********************************************/

/* CAN Error Status Register bits */
#define CAN_ESR_EWGF     ((u8)0x01)
#define CAN_ESR_EPVF     ((u8)0x02)
#define CAN_ESR_BOFF     ((u8)0x04)
#define CAN_ESR_LEC      ((u8)0x70)

/* CAN Error Status Register bits */
#define CAN_EIER_EWGIE    ((u8)0x01)
#define CAN_EIER_EPVIE    ((u8)0x02)
#define CAN_EIER_BOFIE    ((u8)0x04)
#define CAN_EIER_LECIE    ((u8)0x10)
#define CAN_EIER_ERRIE    ((u8)0x80)    

/* CAN transmit error counter Register bits(CAN_TECR) */
#define CAN_TECR_TEC0     ((u8)0x01)    
#define CAN_TECR_TEC1     ((u8)0x02)    
#define CAN_TECR_TEC2     ((u8)0x04)    
#define CAN_TECR_TEC3     ((u8)0x08)    
#define CAN_TECR_TEC4     ((u8)0x10)    
#define CAN_TECR_TEC5     ((u8)0x20)    
#define CAN_TECR_TEC6     ((u8)0x40)    
#define CAN_TECR_TEC7     ((u8)0x80)    

/* CAN RECEIVE error counter Register bits(CAN_TECR) */
#define CAN_RECR_REC0     ((u8)0x01)    
#define CAN_RECR_REC1     ((u8)0x02)    
#define CAN_RECR_REC2     ((u8)0x04)    
#define CAN_RECR_REC3     ((u8)0x08)    
#define CAN_RECR_REC4     ((u8)0x10)    
#define CAN_RECR_REC5     ((u8)0x20)    
#define CAN_RECR_REC6     ((u8)0x40)    
#define CAN_RECR_REC7     ((u8)0x80)    

